docs/providers/pia-ndc-samples-temp/PIA-NDC/doReissuePreview_req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://www.iata.org/IATA/2015/00/2020.1/IATA_OrderReshopRQ">
   <soapenv:Header/>
   <soapenv:Body>
      <IATA_OrderReshopRQ>
         <Party>
            <Sender>
               <TravelAgency>
                  <AgencyID>SELENS</AgencyID>
                  <Name>NDC GATEWAY</Name>
               </TravelAgency>
            </Sender>
         </Party>
         <PayloadAttributes>
            <PrimaryLangID>EN</PrimaryLangID>
         </PayloadAttributes>
         <Request>
            <OrderRefID>7UU0JJ</OrderRefID>
            <ReshopParameters>
               <CurParameter>
                  <RequestedCurCode>PKR</RequestedCurCode>
               </CurParameter>
               <Device>
                  <DeviceOwnerTypeCode>SL</DeviceOwnerTypeCode>
               </Device>
               <LangUsage>
                  <LangCode>EN</LangCode>
               </LangUsage>
            </ReshopParameters>
            <UpdateOrder>
               <ReshopOrder>
                  <ReshopOrderChoice>
                     <ServiceOrder>
                        <AddOfferItems>
                           <FlightRequest>
                              <SpecificOriginDestCriteria>
                                 <DestStationCode>SAW</DestStationCode>
                                 <OriginStationCode>STN</OriginStationCode>
                              </SpecificOriginDestCriteria>
                           </FlightRequest>
                           <ShoppingCriteria>
                              <ExistingOrderCriteria>
                                 <Order>
                                    <OrderID>7UU0JJ</OrderID>
                                    <OrderItem>
                                       <OrderItemID>NWJiMTI4Y2VkNThlNTdjZWU2NDc4NTc5NmFhYzJiNjFiOGEyODg0MmRmMTRkNjA3Y2E4ZWVmMDFmNTA2YTI1YzA0MmE3YTE2MDZkMGE3ZGVjNDUxZTE1Y2M1NGIxMGI1MjgyZTdiZjY0Yjc5YTlmMWQ3MGYzNWVmOTZkNjFmMTgxYTY5NjY3YTFiNTVlMTZlZGE2NDZkNjczNDg3MGMwNzNiMTZmMzk0YTg4NDgyNmU1NGNlOGE3MTY0NGNiMmQyZGVkY2I5Nzk2ZGQ2OTYzNzQ1MzkxZDMzM2Y2ZTQ0PkxPVzFDT01NL1RFU1Q+RUNPPktIST5JU0I+MjAyNS0wNi0xMCAxMzowMDowMD4yMDI1LTA2LTEwIDE0OjU1OjAwPlBLPjM2OD5MPjk+RUNPTk9NWT4zMkE+UzBoSlNWTkNNelk0Pi0xPmJmZmZjYTlhLTZiODQtNDQ1Yi05NDg1LTA1YWE2Y2Y4N2RmZCMwPk9ORV9XQVk+S0hJPklTQj4tMT4=-</OrderItemID>
                                       <OwnerCode>4M</OwnerCode>
                                    </OrderItem>
                                 </Order>
                                 <PaxRefID>ADTPax-402947759</PaxRefID>
                              </ExistingOrderCriteria>
                           </ShoppingCriteria>
                        </AddOfferItems>
                        <DeleteOrderItem>
                           <OrderItemRefID>PK368-02Jun-KHIISB-NDE3MTE0OA</OrderItemRefID>
                        </DeleteOrderItem>
                     </ServiceOrder>
                  </ReshopOrderChoice>
               </ReshopOrder>
            </UpdateOrder>
         </Request>
      </IATA_OrderReshopRQ>
   </soapenv:Body>
</soapenv:Envelope>